#include<stdio.h>
int main()
{
	int i,j;
	int count;
	int ar[6][9] = {{ 0,0,0,1,0,0,0,0,0},
					{0,0,0,0,0,0,0,2,0},
					{0,0,0,0,1,0,0,0,0},
					{0,2,0,1,0,0,1,0,0},
					{0,0,0,1,0,0,0,0,0},
					{0,0,1,0,0,0,1,0,0}
					};
//	for(i=0;i<6;i++)
//	{
//		for(j=0;j<9;j++)
//		{
//			if(ar[i][j]==1)
//			{
//				count++;
//			}
//		}
//	}
//	printf("%d",count);
//		for(i=0;i<6;i++)
//	{
//		for(j=0;j<9;j++)
//		{
//			if(ar[i][j]==2)
//			{
//				printf("%d За%d ї­\n",i ,j);
//			}
//		}
//	}
		for(i=0;i<6;i++)
	{
		for(j=0;j<9;j++)
		{
			if(ar[i][j]==2)
			{
				ar[i-1][j]=5;
				ar[i][j-1]=5;
				ar[i][j+1]=5;
				ar[i+1][j]=5;
			}
		}
	}
		for(i=0;i<6;i++)
	{
		for(j=0;j<9;j++)
		{
			printf("%d ",ar[i][j]);
		}
		printf("\n");
	}
}
